Tekla Open API Reference for Tekla Structures 2025
Grid.GetObjects Method
 Retrieves a DrawingObjectEnumerator for all the grid lines of the grid.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingObjectEnumerator GetObjects()
Public Function GetObjects As DrawingObjectEnumerator
Return Value
Type: DrawingObjectEnumerator
A DrawingObjectEnumerator for all the grid lines of the grid.
Implements
IHasChildren.GetObjects()
See Also
Reference
Grid Class
GetObjects Overload
Tekla.Structures.Drawing Namespace